Revit 2027 API
ParameterTypeId.StructuralAnalyticalHardPoints Property
 "Use hard-points"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalyticalHardPoints { get; }
Public Shared ReadOnly Property StructuralAnalyticalHardPoints As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalyticalHardPoints {
	ForgeTypeId^ get ();
}
static member StructuralAnalyticalHardPoints : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace